Revit 2024 API
BuiltInFailures.FamilyFailures.DeletingBadFamElemError Property
 Family contains invalid elements. They will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DeletingBadFamElemError { get; }
Visual Basic
Public Shared ReadOnly Property DeletingBadFamElemError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DeletingBadFamElemError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace